Tekla Open API Reference for Tekla Structures 2025
Solid.MinimumPoint Property
 Gets the minimum axis-aligned point of the solid in the current plane.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public Point MinimumPoint { get; }
Public ReadOnly Property MinimumPoint As Point
	Get
Property Value
Type: Point
Implements
ISolid.MinimumPoint
See Also
Reference
Solid Class
Tekla.Structures.Model Namespace